Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.80/PIC32CM-JH00/include/component/fuses.h
/*
 * Component description for FUSES
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-01-18T09:30:20Z */
#ifndef _PIC32CMJH00_FUSES_COMPONENT_H_
#define _PIC32CMJH00_FUSES_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR FUSES                                        */
/* ************************************************************************** */

/* -------- FUSES_LOCKBIT_WORD_0 : (FUSES Offset: 0x00) ( R/ 32) LOCKBIT Page Word 0 -------- */
#define FUSES_LOCKBIT_WORD_0_NVMCTRL_CEHL_Pos _U_(24)                                              /**< (FUSES_LOCKBIT_WORD_0) CEHL Bits Position */
#define FUSES_LOCKBIT_WORD_0_NVMCTRL_CEHL_Msk (_U_(0x3F) << FUSES_LOCKBIT_WORD_0_NVMCTRL_CEHL_Pos) /**< (FUSES_LOCKBIT_WORD_0) CEHL Bits Mask */
#define FUSES_LOCKBIT_WORD_0_NVMCTRL_CEHL(value) (FUSES_LOCKBIT_WORD_0_NVMCTRL_CEHL_Msk & ((value) << FUSES_LOCKBIT_WORD_0_NVMCTRL_CEHL_Pos))
#define FUSES_LOCKBIT_WORD_0_Msk              _U_(0x3F000000)                                      /**< (FUSES_LOCKBIT_WORD_0) Register Mask  */


/* -------- FUSES_OTP1_WORD_0 : (FUSES Offset: 0x00) ( R/ 32) OTP1 Page Word 0 -------- */
#define FUSES_OTP1_WORD_0_NVMCTRL_NVM_LOCK_Pos _U_(0)                                               /**< (FUSES_OTP1_WORD_0) NVM Lock Position */
#define FUSES_OTP1_WORD_0_NVMCTRL_NVM_LOCK_Msk (_U_(0xFF) << FUSES_OTP1_WORD_0_NVMCTRL_NVM_LOCK_Pos) /**< (FUSES_OTP1_WORD_0) NVM Lock Mask */
#define FUSES_OTP1_WORD_0_NVMCTRL_NVM_LOCK(value) (FUSES_OTP1_WORD_0_NVMCTRL_NVM_LOCK_Msk & ((value) << FUSES_OTP1_WORD_0_NVMCTRL_NVM_LOCK_Pos))
#define FUSES_OTP1_WORD_0_NVMCTRL_PSZ_Pos     _U_(8)                                               /**< (FUSES_OTP1_WORD_0) NVM Page Size Position */
#define FUSES_OTP1_WORD_0_NVMCTRL_PSZ_Msk     (_U_(0x3) << FUSES_OTP1_WORD_0_NVMCTRL_PSZ_Pos)      /**< (FUSES_OTP1_WORD_0) NVM Page Size Mask */
#define FUSES_OTP1_WORD_0_NVMCTRL_PSZ(value)  (FUSES_OTP1_WORD_0_NVMCTRL_PSZ_Msk & ((value) << FUSES_OTP1_WORD_0_NVMCTRL_PSZ_Pos))
#define FUSES_OTP1_WORD_0_NVMCTRL_NVMP_Pos    _U_(16)                                              /**< (FUSES_OTP1_WORD_0) Number of NVM Pages Position */
#define FUSES_OTP1_WORD_0_NVMCTRL_NVMP_Msk    (_U_(0x3FFF) << FUSES_OTP1_WORD_0_NVMCTRL_NVMP_Pos)  /**< (FUSES_OTP1_WORD_0) Number of NVM Pages Mask */
#define FUSES_OTP1_WORD_0_NVMCTRL_NVMP(value) (FUSES_OTP1_WORD_0_NVMCTRL_NVMP_Msk & ((value) << FUSES_OTP1_WORD_0_NVMCTRL_NVMP_Pos))
#define FUSES_OTP1_WORD_0_Msk                 _U_(0x3FFF03FF)                                      /**< (FUSES_OTP1_WORD_0) Register Mask  */


/* -------- FUSES_OTP1_WORD_1 : (FUSES Offset: 0x04) ( R/ 32) OTP1 Page Word 1 -------- */
#define FUSES_OTP1_WORD_1_NVMCTRL_DATAFLASHP_Pos _U_(0)                                               /**< (FUSES_OTP1_WORD_1) Number of Data Flash Pages Position */
#define FUSES_OTP1_WORD_1_NVMCTRL_DATAFLASHP_Msk (_U_(0xFF) << FUSES_OTP1_WORD_1_NVMCTRL_DATAFLASHP_Pos) /**< (FUSES_OTP1_WORD_1) Number of Data Flash Pages Mask */
#define FUSES_OTP1_WORD_1_NVMCTRL_DATAFLASHP(value) (FUSES_OTP1_WORD_1_NVMCTRL_DATAFLASHP_Msk & ((value) << FUSES_OTP1_WORD_1_NVMCTRL_DATAFLASHP_Pos))
#define FUSES_OTP1_WORD_1_Msk                 _U_(0x000000FF)                                      /**< (FUSES_OTP1_WORD_1) Register Mask  */


/* -------- FUSES_OTP2_WORD_1 : (FUSES Offset: 0x04) ( R/ 32) OTP2 Page Word 1 -------- */
#define FUSES_OTP2_WORD_1_NVMCTRL_ECCDIS_NOTPRESENT_Pos _U_(16)                                              /**< (FUSES_OTP2_WORD_1) Allows the ECC disable bit (ECCCTRL.ECCDIS) to become not available for the user with a device fuse. Position */
#define FUSES_OTP2_WORD_1_NVMCTRL_ECCDIS_NOTPRESENT_Msk (_U_(0x1) << FUSES_OTP2_WORD_1_NVMCTRL_ECCDIS_NOTPRESENT_Pos) /**< (FUSES_OTP2_WORD_1) Allows the ECC disable bit (ECCCTRL.ECCDIS) to become not available for the user with a device fuse. Mask */
#define FUSES_OTP2_WORD_1_NVMCTRL_ECCDIS_NOTPRESENT(value) (FUSES_OTP2_WORD_1_NVMCTRL_ECCDIS_NOTPRESENT_Msk & ((value) << FUSES_OTP2_WORD_1_NVMCTRL_ECCDIS_NOTPRESENT_Pos))
#define FUSES_OTP2_WORD_1_NVMCTRL_ECCDATAFLASHDIS_NOTPRESENT_Pos _U_(17)                                              /**< (FUSES_OTP2_WORD_1) Allows the ECC Data Flash disable bit (ECCCTRL.ECCDFDIS) to become not available for the user with a device fuse. Position */
#define FUSES_OTP2_WORD_1_NVMCTRL_ECCDATAFLASHDIS_NOTPRESENT_Msk (_U_(0x1) << FUSES_OTP2_WORD_1_NVMCTRL_ECCDATAFLASHDIS_NOTPRESENT_Pos) /**< (FUSES_OTP2_WORD_1) Allows the ECC Data Flash disable bit (ECCCTRL.ECCDFDIS) to become not available for the user with a device fuse. Mask */
#define FUSES_OTP2_WORD_1_NVMCTRL_ECCDATAFLASHDIS_NOTPRESENT(value) (FUSES_OTP2_WORD_1_NVMCTRL_ECCDATAFLASHDIS_NOTPRESENT_Msk & ((value) << FUSES_OTP2_WORD_1_NVMCTRL_ECCDATAFLASHDIS_NOTPRESENT_Pos))
#define FUSES_OTP2_WORD_1_NVMCTRL_CEHL_NOTPRESENT_Pos _U_(18)                                              /**< (FUSES_OTP2_WORD_1) Allows the CEHL bit to be able to be used by the user to Chip Erase Hard Lock or disabled and no Chip Erase Hard lock allowed. Position */
#define FUSES_OTP2_WORD_1_NVMCTRL_CEHL_NOTPRESENT_Msk (_U_(0x1) << FUSES_OTP2_WORD_1_NVMCTRL_CEHL_NOTPRESENT_Pos) /**< (FUSES_OTP2_WORD_1) Allows the CEHL bit to be able to be used by the user to Chip Erase Hard Lock or disabled and no Chip Erase Hard lock allowed. Mask */
#define FUSES_OTP2_WORD_1_NVMCTRL_CEHL_NOTPRESENT(value) (FUSES_OTP2_WORD_1_NVMCTRL_CEHL_NOTPRESENT_Msk & ((value) << FUSES_OTP2_WORD_1_NVMCTRL_CEHL_NOTPRESENT_Pos))
#define FUSES_OTP2_WORD_1_Msk                 _U_(0x00070000)                                      /**< (FUSES_OTP2_WORD_1) Register Mask  */


/* -------- FUSES_OTP3_WORD_1 : (FUSES Offset: 0x04) ( R/ 32) OTP3 Page Word 1 -------- */
#define FUSES_OTP3_WORD_1_NVMCTRL_DUMMY2_Pos  _U_(31)                                              /**< (FUSES_OTP3_WORD_1) Dummy for OTP3 entry Position */
#define FUSES_OTP3_WORD_1_NVMCTRL_DUMMY2_Msk  (_U_(0x1) << FUSES_OTP3_WORD_1_NVMCTRL_DUMMY2_Pos)   /**< (FUSES_OTP3_WORD_1) Dummy for OTP3 entry Mask */
#define FUSES_OTP3_WORD_1_NVMCTRL_DUMMY2(value) (FUSES_OTP3_WORD_1_NVMCTRL_DUMMY2_Msk & ((value) << FUSES_OTP3_WORD_1_NVMCTRL_DUMMY2_Pos))
#define FUSES_OTP3_WORD_1_Msk                 _U_(0x80000000)                                      /**< (FUSES_OTP3_WORD_1) Register Mask  */

#define FUSES_OTP3_WORD_1_NVMCTRL_DUMMY_Pos   _U_(31)                                              /**< (FUSES_OTP3_WORD_1 Position) Dummy for OTP3 entry */
#define FUSES_OTP3_WORD_1_NVMCTRL_DUMMY_Msk   (_U_(0x1) << FUSES_OTP3_WORD_1_NVMCTRL_DUMMY_Pos)    /**< (FUSES_OTP3_WORD_1 Mask) NVMCTRL_DUMMY */
#define FUSES_OTP3_WORD_1_NVMCTRL_DUMMY(value) (FUSES_OTP3_WORD_1_NVMCTRL_DUMMY_Msk & ((value) << FUSES_OTP3_WORD_1_NVMCTRL_DUMMY_Pos)) 

